khoih-prog/ESP8266_AT_WebServer/src/Parsing-impl.h
      RequestArgument& arg = _currentArgs[arg_total];
      handler(arg.key, arg.value, data, equal_index, pos, key_end_pos, next_index);

      ++arg_total;
      pos = next_index + 1;
    }

    if (next_index == -1)
      break;
  }

  LOGDEBUG1(F("args count: "), arg_total);

  return arg_total;
}

void ESP8266_AT_WebServer::_uploadWriteByte(uint8_t b)
{
  if (_currentUpload->currentSize == HTTP_UPLOAD_BUFLEN)
  {
    if(_currentHandler && _currentHandler->canUpload(_currentUri))
      _currentHandler->upload(*this, _currentUri, *_currentUpload);
      
    _currentUpload->totalSize += _currentUpload->currentSize;
    _currentUpload->currentSize = 0;
  }
  _currentUpload->buf[_currentUpload->currentSize++] = b;
}

uint8_t ESP8266_AT_WebServer::_uploadReadByte(ESP8266_AT_Client& client)
{
  int res = client.read();
  
  if(res == -1)
  {
    while(!client.available() && client.connected())
      yield();
      
    res = client.read();
  }
  return (uint8_t)res;
}

#else

void ESP8266_AT_WebServer::_parseArguments(String data) {

  LOGDEBUG1(F("args: "), data);

  if (_currentArgs)
    delete[] _currentArgs;
  _currentArgs = 0;
  if (data.length() == 0) {
    _currentArgCount = 0;
    _currentArgs = new RequestArgument[1];
    return;
  }
  _currentArgCount = 1;

  for (int i = 0; i < (int)data.length(); ) {
    i = data.indexOf('&', i);
    if (i == -1)
      break;
    ++i;
    ++_currentArgCount;
  }

  LOGDEBUG1(F("args count: "), _currentArgCount);

  _currentArgs = new RequestArgument[_currentArgCount + 1];
  int pos = 0;
  int iarg;
  for (iarg = 0; iarg < _currentArgCount;) {
    int equal_sign_index = data.indexOf('=', pos);
    int next_arg_index = data.indexOf('&', pos);

    LOGDEBUG1(F("pos: "), pos);
    LOGDEBUG1(F("=@ "), equal_sign_index);
    LOGDEBUG1(F(" &@ "), next_arg_index);

    if ((equal_sign_index == -1) || ((equal_sign_index > next_arg_index) && (next_arg_index != -1))) {

      LOGDEBUG1(F("arg missing value: "), iarg);

      if (next_arg_index == -1)
        break;
      pos = next_arg_index + 1;
      continue;
    }
    RequestArgument& arg = _currentArgs[iarg];
    arg.key = data.substring(pos, equal_sign_index);
    arg.value = data.substring(equal_sign_index + 1, next_arg_index);

    LOGDEBUG1(F("arg: "), iarg);
    LOGDEBUG1(F("key: "), arg.key);
    LOGDEBUG1(F("value: "), arg.value);

    ++iarg;
    if (next_arg_index == -1)
      break;
    pos = next_arg_index + 1;
  }
  _currentArgCount = iarg;

  LOGDEBUG1(F("args count: "), _currentArgCount);
}



void ESP8266_AT_WebServer::_uploadWriteByte(uint8_t b) {
  if (_currentUpload.currentSize == HTTP_UPLOAD_BUFLEN) {
    if (_currentHandler && _currentHandler->canUpload(_currentUri))
      _currentHandler->upload(*this, _currentUri, _currentUpload);
    _currentUpload.totalSize += _currentUpload.currentSize;
    _currentUpload.currentSize = 0;
  }
  _currentUpload.buf[_currentUpload.currentSize++] = b;
}

uint8_t ESP8266_AT_WebServer::_uploadReadByte(ESP8266_AT_Client& client) {
  int res = client.read();
  if (res == -1) {
    while (!client.available() && client.connected())
      yield();
    res = client.read();
  }
  return (uint8_t)res;
}

#endif

#if USE_NEW_WEBSERVER_VERSION

bool ESP8266_AT_WebServer::_parseForm(ESP8266_AT_Client& client, const String& boundary, uint32_t len)
{
  (void) len;

  LOGDEBUG1(F("Parse Form: Boundary: "), boundary);
  LOGDEBUG1(F("Length: "), len);

  String line;
  int retry = 0;
  
  do 
  {
    line = client.readStringUntil('\r');
    ++retry;
  } while (line.length() == 0 && retry < 3);

  client.readStringUntil('\n');
  //start reading the form
  if (line == ("--"+boundary)){
  
    if(_postArgs) delete[] _postArgs;
    _postArgs = new RequestArgument[WEBSERVER_MAX_POST_ARGS];
    _postArgsLen = 0;
    
    while(1)
    {
      String argName;
      String argValue;
      String argType;
      String argFilename;
      bool argIsFile = false;

      line = client.readStringUntil('\r');
      client.readStringUntil('\n');
      
      if (line.length() > 19 && line.substring(0, 19).equalsIgnoreCase(F("Content-Disposition")))
      {
        int nameStart = line.indexOf('=');
        
        if (nameStart != -1)
        {
          argName = line.substring(nameStart+2);
          nameStart = argName.indexOf('=');
          if (nameStart == -1){
            argName = argName.substring(0, argName.length() - 1);
          } 
          else 
          {
            argFilename = argName.substring(nameStart+2, argName.length() - 1);
            argName = argName.substring(0, argName.indexOf('"'));
            argIsFile = true;
            
            LOGDEBUG1(F("PostArg FileName: "), argFilename);

            //use GET to set the filename if uploading using blob
            if (argFilename == F("blob") && hasArg("filename")) 
              argFilename = arg("filename");
          }
          
          LOGDEBUG1(F("PostArg Name: "), argName);
          
          using namespace mime;
          argType = mimeTable[txt].mimeType;
          line = client.readStringUntil('\r');
          client.readStringUntil('\n');
                   
          if (line.length() > 12 && line.substring(0, 12).equalsIgnoreCase("Content-Type"))
          {
            argType = line.substring(line.indexOf(':') + 2);
            //skip next line
            client.readStringUntil('\r');
            client.readStringUntil('\n');
          }
          
          
          LOGDEBUG1(F("PostArg Type: "), argType);

          if (!argIsFile)
          {
            while(1)
            {
              line = client.readStringUntil('\r');
              client.readStringUntil('\n');
              if (line.startsWith("--" + boundary)) break;
              if (argValue.length() > 0) argValue += "\n";
              argValue += line;
            }
            
            LOGDEBUG1(F("PostArg Value: "), argValue);

            RequestArgument& arg = _postArgs[_postArgsLen++];
            arg.key = argName;
            arg.value = argValue;

            if (line == ("--" + boundary + "--"))
            {
              LOGDEBUG(F("Done Parsing POST"));

              break;
            }
          } 
          else 
          {          
           //_currentUpload.reset(new HTTPUpload());
           if (!_currentUpload)
            _currentUpload = new HTTPUpload();
            
            _currentUpload->status = UPLOAD_FILE_START;
            _currentUpload->name = argName;
            _currentUpload->filename = argFilename;
            _currentUpload->type = argType;
            _currentUpload->totalSize = 0;
            _currentUpload->currentSize = 0;
            _currentUpload->contentLength = len;
            
            LOGDEBUG1(F("Start File: "), _currentUpload->filename);
            LOGDEBUG1(F("Type: "), _currentUpload->type);

            if(_currentHandler && _currentHandler->canUpload(_currentUri))
              _currentHandler->upload(*this, _currentUri, *_currentUpload);
            _currentUpload->status = UPLOAD_FILE_WRITE;
            uint8_t argByte = _uploadReadByte(client);
readfile:
            while(argByte != 0x0D){
              if (!client.connected()) return _parseFormUploadAborted();
              _uploadWriteByte(argByte);
              argByte = _uploadReadByte(client);
            }

            argByte = _uploadReadByte(client);
            if (!client.connected()) return _parseFormUploadAborted();
            if (argByte == 0x0A){
              argByte = _uploadReadByte(client);
              if (!client.connected()) return _parseFormUploadAborted();
              if ((char)argByte != '-'){
                //continue reading the file
                _uploadWriteByte(0x0D);
                _uploadWriteByte(0x0A);
                goto readfile;
              } else {
                argByte = _uploadReadByte(client);
                if (!client.connected()) return _parseFormUploadAborted();
                if ((char)argByte != '-'){
                  //continue reading the file
                  _uploadWriteByte(0x0D);
                  _uploadWriteByte(0x0A);
                  _uploadWriteByte((uint8_t)('-'));
                  goto readfile;
                }
              }

